In [ ]:
import pandas as pd

df = pd.DataFrame([[1, 'A', -3],[3, 'B', 2.5],[5, 'C', -2.5],[7, 'D', 2.8],[9, 'E', 3]], columns=['ID', 'varname', 'marks'])
df

   ID varname  marks
0   1       A   -3.0
1   3       B    2.5
2   5       C   -2.5
3   7       D    2.8
4   9       E    3.0

Finding absolute value of Age column

In [ ]:
df['marks_positive'] = df['marks'].abs()
df

   ID varname  marks  marks_positive
0   1       A   -3.0             3.0
1   3       B    2.5             2.5
2   5       C   -2.5             2.5
3   7       D    2.8             2.8
4   9       E    3.0             3.0

Creating dataframe with 3 columns ['firstName', 'lastName', 'age']

In [ ]:
df_str = pd.DataFrame([['jen', 'ani', 50],['ross', 'geller', 52],['matt', 'bla', 50],['lisa', 'kudro', 57], ['monica', 'geller', 53]], columns = ['firstName', 'LastName', 'age'])
df_str

  firstName LastName  age
0       jen      ani   50
1      ross   geller   52
2      matt      bla   50
3      lisa    kudro   57
4    monica   geller   53

Concatenating FirstName and LastName columns assigning to FullName column

In [ ]:
df_str['fullName'] = df_str['firstName']+df_str['LastName']
df_str

  firstName LastName      fullName
0       jen      ani        jenani
1      ross   geller    rossgeller
2      matt      bla       mattbla
3      lisa    kudro     lisakudro
4    monica   geller  monicageller

Finding Maximum value of Age column

In [ ]:
df_str['age'].max()

57

Finding Minimum value of Age column

In [ ]:
df_str['age'].min()

Finding Root Mean Square value of age column

In [ ]:
((df_str['age'].values)**2).mean()**.5

52.46332052015008